"""Андрію, розумію, що має бути не так. Я додаю +1 не до індекса, а просто до одиниці, бо вона під нульовим індексом в лісті.
Також розумію, що там не потрібно двічі писати new_list[0] += 1, але я не вигадав як інакше здійснити апенд тільки 1 раз, щоб не виходив безкінечний луп.
Буду чекати на твій коментар з рекомендацією щодо покращення коду і як взагалі це все зробити використовуючи саме індекси. Дякую!"""

new_list = list(range(1, 101))
final_list = []

while new_list[0] < 100:
    if (new_list[0] % 7 == 0) and not (new_list[0] % 5 == 0):
        final_list.append(new_list[0])
        new_list[0] += 1
    else:
        new_list[0] += 1

print(final_list)

# new_list = list(range(1, 101))
# final_list = []
# a = 1

# while a < 100:
#     if (a % 7 == 0) and not (a % 5 == 0):
#         final_list.append(a)
#         a += 1
#     else:
#         a += 1

# print(final_list)